Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/red-hen-omegat.tmx
Source language: en_us
Languages: chr

source: So go, lazy cat!
chr: Ꭳ, ᏪᎾ, ᎯᎾᎵ ᏪᏌ!

source: So go, lazy rat!
chr: Ꭳ, ᏪᎾ, ᎯᎾᎵ ᎧᏂᏈᏌ!

source: So she did.
chr: ᎠᎴ ᏄᏛᏁᎴ.

source: So the chicken went to the field.
chr: ᏥᏔᎦᏃ ᏠᎨᏏ ᎤᏪᏅᏎ.

source: So the little hen brought it.
chr: ᎥᏍᎩᏅ ᎢᏳᏍᏗ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏒᏎ.

source: The cat can steal.
chr: ᏪᏌ ᎬᏩᏃᏍᎩᏍᏗ.

source: The cat did not go to the field.
chr: Ꮭ ᏪᏌ ᏠᎨᏏ ᏳᏪᏅᏎ.

source: The cat is lazy.
chr: ᏪᏌ ᎦᎾᎵ.

source: The cat is my friend.
chr: ᏪᏌ ᎣᎩᎾᎵᎢ.

source: The cat is too lazy to gather the wheat.
chr: ᏪᏌ ᏙᎯᏳ ᎦᎾᎵ ᎠᎴ Ꮭ ᎤᏣᎴᏍᏗ ᏳᏩᏟᏌᏅᎭ.

source: The cat is too lazy to go to the field.
chr: ᏪᏌ ᎦᎾᎵ ᎥᏍᎩᏅ ᎢᏳᏍᏗ Ꮭ ᎡᎵᏊ ᏰᎾ.

source: The cat is too lazy.
chr: Ꮎ ᏪᏌ ᏙᎯᏳ ᎦᎾᎵ.

source: The cat might have planted it.
chr: ᏪᏌ ᎬᏩᏫᏍᏗ ᎨᏎᎢ.

source: The cat was too lazy and did not plant the seed.
chr: Ꮎ ᏪᏌ ᏙᎯᏳ ᎦᎾᎵ ᎨᏎ ᎠᎴ Ꮭ ᎤᎩᏔ ᏳᏫᏎ.

source: The cat will eat it, too, if she can.
chr: ᏪᏌ ᎠᎬᎭ ᏍᏊ ᏱᏂᎬᏩᏛᏁᏗ.

source: The cat will jump upon the table.
chr: ᏪᏌ ᏛᎩᎸᏂ ᎦᏍᎩᎸᎢ.

source: The cat will not find a seed.
chr: Ꮭ ᏪᏌ ᎡᎵᏊ ᎤᎩᏔ ᏯᏩᏔ.

source: The cat will not open it.
chr: Ꮭ ᏪᏌ ᏱᏛᏍᏚᎢᏏ.

source: The cat would not go.
chr: Ꮭ ᏪᏌ ᏰᏅᏒᎭ.

source: The cat would not plant it.
chr: Ꮭ ᏪᏌ ᏳᏫᏎ.

source: The chicken found a seed.
chr: ᏥᏔᎦ ᎤᎩᏔ ᎤᏩᏛᎮ.

source: The chicken found the seed.
chr: ᏥᏔᎦ ᎤᎩᏔ ᎠᏩᏔ.

source: The chicken is female.
chr: Ꮎ ᏥᏔᎦ ᎠᎩᏏ.

source: The chicken is not lazy.
chr: Ꮭ ᎦᎾᎵ ᏥᏔᎦ ᏱᎩ.

source: The chicken is red.
chr: ᏥᏔᎦ ᎠᎩᎦᎨ.

source: The chicken sees the seed.
chr: ᏥᏔᎦ ᎤᎩᏔ ᎠᎪᏩᏘᎭ.

source: The flour is in the bag.
chr: ᎢᏌ ᎠᏥᎵᏗᎭ ᏕᎦᎵᏗ.

source: The flour will be good.
chr: ᎢᏌ ᎣᏍᏓ ᎨᏎᏍᏗ.

source: The good little chicken.
chr: ᎣᏍᏓ ᎤᏍᏗ ᏥᏔᎦ.

source: The good little red hen.
chr: ᎣᏍᏓ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: The hen laughed to herself.
chr: ᏥᏔᎦ ᎤᏩᏌ ᎤᏰᏘᏎᎴ.

source: The lazy cat can sleep.
chr: ᎦᎾᎵ ᏪᏌ ᎬᏩᎵᏍᏓᏴᏗ.

source: The lazy cat shall not have it.
chr: Ꮭ ᎦᎾᎵ ᏪᏌ ᏱᏛᏫᏏ.

source: The lazy cat should take it.
chr: ᎦᎾᎵ ᏪᏌ ᎤᏫᏛᎲᎭ.

source: The lazy cat would not bring it.
chr: Ꮭ ᎦᎾᎵ ᏪᏌ ᏳᎩᏒᏎ.

source: The lazy cat!
chr: Ꮎ ᎦᎾᎵ ᏪᏌ!

source: The lazy pig can eat.
chr: ᎦᎾᎵ ᏏᏆ ᎬᏩᎵᏍᏓᏴᏗ.

source: The lazy pig can sleep.
chr: ᎦᎾᎵ ᏏᏆ ᎬᏩᏢᏅᏗ.

source: The lazy pig shall not have it."
chr: Ꮭ ᎦᎾᎵ ᏏᏆ ᏱᏛᏫᏏ.”

source: The lazy pig should take it.
chr: ᎦᎾᎵ ᏏᏆ ᎤᏫᏛᎲᎭ.

source: The lazy pig would not bring it.
chr: Ꮭ ᎦᎾᎵ ᏏᏆ ᎤᎩᏒᏎ.

source: The lazy pig!
chr: Ꮎ ᎦᎾᎵ ᏏᏆ!`

source: The lazy rat can eat.
chr: ᎦᎾᎵ ᎧᏂᏈᏌ ᎬᏩᎵᏍᏓᏴᏗ.

source: The lazy rat shall not have it.
chr: Ꮭ ᎦᎾᎵ ᎧᏂᏈᏌ ᏱᏛᏫᏏ.

source: The lazy rat should take it.
chr: ᎦᎾᎵ ᎧᏂᏈᏌ ᎤᏫᏛᎲᎭ.

source: The lazy rat would not bring it.
chr: Ꮭ ᎦᎾᎵ ᎧᏂᏈᏌ ᏳᎩᏒᏎ.

source: The lazy rat!
chr: Ꮎ ᎦᎾᎵ ᎧᏂᏈᏌ!

source: The little hen brought it.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏒᏎ.

source: The little red chicken has found a seed.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏔ ᎠᏩᏔ.

source: The little red hen found a seed.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏔ ᎤᏩᏛᎮ.

source: The little red hen found the seed.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏔ ᎤᏩᏛᎮ.

source: The little red hen found the wheat seed.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᏣᎴᏍᏗ ᎤᎩᏔ ᎤᏩᏛᎮ.

source: The little red hen is not lazy.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ Ꮭ ᎦᎾᎵ ᏱᎩ.

source: The little red hen langhed to herself.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᏩᏌ ᎤᏰᏘᏎᎴ.

source: The little red hen laughed to herself.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᏩᏌ ᎤᏰᏘᏎᎴ.

source: The little red hen looked at the lazy pig.
chr: ᎦᎾᎵ ᏏᏆ ᎤᎦᏙᏍᏔᏁ Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: The little red hen planted it.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᏫᏎ.

source: The little red hen went to the field.
chr: Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᏠᎨᏏ ᎤᏪᏅᏎ.

source: The little red hen went to the mill.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᏗᏍᏙᏍᎩᎢ ᏭᏪᏅᏎ.

source: The little red hen will open the bag.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᏕᎦᎵᏗ ᏛᏍᏚᎢᏏ.

source: The little red hen will take it.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᏛᏫᏛᎯ.

source: The little red hen!
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ!

source: The miller has ground it into flour.
chr: ᏗᏍᏙᏍᎩ ᎤᏍᏙᎥᎩ. ᎢᏌ ᏄᎵᏍᏔᏅᎩ.

source: The miller will grind and grind and grind.
chr: ᏗᏍᏙᏍᎩ ᏛᏍᏙᎢ ᎠᎴ ᏛᏍᏙᎢ ᎠᎴ ᏛᏍᏙᎢ.

source: The miller will grind it and it will become flour.
chr: ᏗᏍᏙᏍᎩ ᏛᏍᏙᎢ ᎠᎴ ᎢᏌ ᏂᏓᎦᎵᏍᏔᏂ.

source: The miller will grind the wheat.
chr: ᏗᏍᏙᏍᎩ ᎤᏣᎴᏍᏗ ᏛᏍᏙᎢ.

source: The pig can steal.
chr: ᏏᏆ ᎬᏩᏃᏍᎩᏍᏗ.

source: The pig did not go to the field.
chr: Ꮭ ᏏᏆ ᏠᎨᏏ ᏳᏪᏅᏎ.

source: The pig is lazy.
chr: ᏏᏆ ᎦᎾᎵ.

source: The pig is my friend.
chr: ᏏᏆ ᎣᎩᎾᎵᎢ.

source: The pig is too lazy to gather the wheat.
chr: ᏏᏆ ᏙᎯᏳ ᎦᎾᎵ ᎠᎴ Ꮭ ᎤᏣᎴᏍᏗ ᏳᏩᏟᏌᏅᎭ.

source: The pig is too lazy to go to the field.
chr: ᏏᏆ ᎦᎾᎵ ᎥᏍᎩᏅ ᎢᏳᏍᏗ Ꮭ ᎡᎵᏊ ᏰᎾ.

source: The pig is too lazy.
chr: Ꮎ ᏏᏆ ᏙᎯᏳ ᎦᎾᎵ.

source: The pig might have found the seed.
chr: ᏏᏆ ᎤᎩᏔ ᎬᏩᏛᏗ ᎨᏎᎢ.

source: The pig was too lazy and did not find the seed.
chr: Ꮎ ᏏᏆ ᏙᎯᏳ ᎦᎾᎵ ᎨᏎ ᎠᎴ Ꮭ ᎤᎩᏔ ᏳᏩᏛᎮ.

source: The pig will not open it.
chr: Ꮭ ᏏᏆ ᏱᏛᏍᏚᎢᏏ.

source: The pig would not go.
chr: Ꮭ ᏏᏆ ᏰᏅᏒᎭ.

source: The rat can steal.
chr: ᎧᏂᏈᏌ ᎬᏩᏃᏍᎩᏍᏗ.

source: The rat did not go to the field.
chr: Ꮭ ᎧᏂᏈᏌ ᏠᎨᏏ ᏳᏪᏅᏎ.

source: The rat is lazy.
chr: ᎧᏂᏈᏌ ᎦᎾᎵ.

source: The rat is my friend.
chr: ᎧᏂᏈᏌ ᎣᎩᎾᎵᎢ.

source: The rat is too lazy to go to the field.
chr: ᎧᏂᏈᏌ ᎦᎾᎵ ᎥᏍᎩᏅ ᎢᏳᏍᏗ Ꮭ ᎡᎵᏊ ᏰᎾ.

source: The rat is too lazy, too.
chr: ᎧᏂᏈᏌ ᏙᎯᏳ ᎦᎾᎵ ᏍᏊ.

source: The rat is too lazy.
chr: Ꮎ ᎧᏂᏈᏌ ᏙᎯᏳ ᎦᎾᎵ.

source: The rat might have gathered the wheat.
chr: ᎧᏂᏈᏌ ᎤᏣᎴᏍᏗ ᎬᏩᏟᏐᏗ ᎨᏎᎢ.

source: The rat was too lazy and did not gather the wheat.
chr: Ꮎ ᎧᏂᏈᏌ ᏙᎯᏳ ᎦᎾᎵ ᎨᏎ ᎠᎴ Ꮭ ᎤᏣᎴᏍᏗ ᏳᏩᏟᏌᏁ.

source: The rat will eat it, too, if she can.
chr: ᎧᏂᏈᏌ ᎠᎬᎭ ᏍᏊ ᏱᏂᎬᏩᏛᏁᏗ.

source: The rat will not open it.
chr: Ꮭ ᎧᏂᏈᏌ ᏱᏛᏍᏚᎢᏏ.

source: The rat would not gather the wheat.
chr: Ꮭ ᎧᏂᏈᏌ ᎤᏣᎴᏍᏗ ᏳᏩᏟᏌᏁ.

source: The rat would not go.
chr: Ꮭ ᎧᏂᏈᏌ ᏰᏅᏒᎭ.

source: The red chicken sees a seed.
chr: ᎠᎩᎦᎨ ᏥᏔᎦ ᎤᎩᏔ ᎠᎪᏩᏘᎭ.

source: The red hen has found a seed.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏔ ᎠᏩᏔ.

source: The red hen will find a seed.
chr: ᎡᎵᏊ ᎤᎩᏔ ᏯᏩᏔ Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: The wheat must go to the mill.
chr: ᎩᎶ ᎤᏣᎴᏍᏗ ᏗᏍᏙᏍᎩᎢ ᎤᏫᏘᏗ.

source: The wheat plant will grow and grow.
chr: ᎤᏣᎴᏍᏗ ᎦᎪᏗ ᏛᏛᏏ ᎠᎴ ᏛᏛᏏ.

source: Then it will have wheat seeds.
chr: ᎾᎯᏳ ᎤᏣᎴᏍᏗ ᎤᏂᎩᏔ ᏚᎮᏍᏗ.

source: Then she planted it.
chr: ᎾᎯᏳ ᎤᏫᏎ.

source: There is flour in the bag.
chr: ᎢᏌ ᏕᎦᎵᏗ ᎤᏣᎠ.

source: There is the cat.
chr: ᎤᎿ ᏪᏌ.

source: There is the pig.
chr: ᎤᎿ ᏏᏆ.

source: There is the rat.
chr: ᎤᎿ ᎧᏂᏈᏌ.

source: There she is.
chr: ᎤᎿ ᏥᏔᎦ.

source: There they are.
chr: ᎥᏍᎩᎾ ᎤᎿ.

source: They are not kind friends.
chr: ᎥᏝ ᎠᏃᏍᏓ ᏧᎾᎵᎢ ᏱᎩ.

source: They are not too lazy to eat it.
chr: ᎤᏂᎩᏍᏗ Ꮭ ᎥᏍᎩᎾ ᎠᏂᎾᎵ ᏱᎩ.

source: They are too lazy to be kind.
chr: ᏙᎯᏳ ᎠᏂᎾᎵ ᎢᏳᏍᏗ Ꮭ ᎠᏃᏍᏓ ᏱᎩ.

source: They might help gather the wheat.
chr: ᏧᏩᏟᏐᏗ ᎬᏩᏂᏍᏕᎸᏗ.

source: They might help plant them.
chr: ᎤᏫᏍᏗ ᎬᏩᏂᏍᏕᎸᏗ.

source: They might try to find the seeds.
chr: ᎤᏂᎩᏔ ᏗᎬᏩᏂᏩᏛᏗ.

source: They were too lazy to find the seed.
chr: ᎥᏍᎩᎾ ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ Ꮭ ᎤᎩᏔ ᏳᏂᏩᏛᎮ.

source: They were too lazy to gather the wheat.
chr: ᎥᏍᎩᎾ ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ Ꮭ ᎤᏣᎴᏍᏗ ᏳᏂᏟᏌᏁ.

source: They were too lazy to go.
chr: ᎤᏙᎯᏳ ᎠᏂᎾᎵ ᎢᏳᏍᏗ Ꮭ ᏱᏭᏁᏅᏎ.

source: They were too lazy to make it.
chr: ᎥᏍᎩᎾ ᏙᎯᏳ ᎠᏂᎾᎵ ᎢᏳᏍᏗ Ꮭ ᏳᏂᏩᏚᏁ.

source: They were too lazy to plant the seed.
chr: ᎥᏍᎩᎾ ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ Ꮭ ᎤᎩᏔ ᏳᏂᏫᏎ.

source: They were too lazy.
chr: ᎥᏍᎩᎾ ᏙᎯᏳ ᎠᏂᎾᎵ ᎨᏎᎢ.

source: They will get it if they can.
chr: ᎠᏂᎩᏒᎭ ᏱᏂᎬᏩᎾᏛᏁᏗ.

source: They will jump upon the table.
chr: ᏛᎾᎩᎸᏂ ᎦᏍᎩᎸᎢ.

source: They will steal the bread.
chr: ᎦᏚ ᏛᏂᏃᏍᎩᏏ.

source: They would not bring it from the mill.
chr: Ꮭ ᏳᏂᎩᏒᏎ ᏗᏍᏙᏍᎩᎢ.

source: They would not take it to the mill.
chr: Ꮭ ᏳᏂᏫᏛᎮ ᏗᏍᏙᏍᎩᎢ.

source: This cat is lazy.
chr: ᎯᎠ ᏪᏌ ᎦᎾᎵ.

source: This is a chicken.
chr: ᎯᎠ ᏥᏔᎦ.

source: This is a red chicken.
chr: ᎯᎠ ᎠᎩᎦᎨ ᏥᏔᎦ.

source: This is the bag.
chr: ᎯᎠ ᏕᎦᎵᏗ.

source: This is the red hen.
chr: ᎯᎠ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: This person is the miller.
chr: ᎯᎠ ᎠᏴᏫ ᏗᏍᏙᏍᎩ.

source: This pig is lazy.
chr: ᎯᎠ ᏏᏆ ᎦᎾᎵ.

source: This rat is lazy.
chr: ᎯᎠ ᎧᏂᏈᏌ ᎦᎾᎵ.

source: Three lazy friends.
chr: ᎠᏂᏦᎢ ᎠᏂᎾᎵ ᏧᎾᎵᎢ.

source: Too lazy to be kind.
chr: ᏙᎯᏳ ᎢᏥᎾᎵ ᎢᏳᏍᏗ Ꮭ ᎢᏦᏍᏓ ᏱᎩ.

source: Too lazy to bring it from the mill.
chr: ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ ᏗᏍᏙᏍᎩᎢ ᎥᏝ ᏱᏛᏂᎩᏒᏏ!

source: Too lazy to bring the bag!
chr: ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ ᎥᏝ ᏕᎦᎵᏗ ᏱᏛᏂᎩᏒᏏ!

source: Too lazy to go for the flour!
chr: ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ ᎥᏝ ᎢᏌ ᏱᏛᏂᎩᏒᏏ!

source: Too lazy to go to the mill!
chr: ᏙᎯᏳ ᎠᏂᎾᎵ ᎠᎴ ᎥᏝ ᏗᏍᏙᏍᎩᎢ ᏱᏛᏂᏫᏛᎯ!

source: Too lazy to help.
chr: ᏙᎯᏳ ᎢᏥᎾᎵ ᎢᏳᏍᏗ Ꮭ ᏱᏣᎵᏍᏕᎵᏍᎪ.

source: Watch!
chr: ᎦᎯᏯᎦᏙᏍᏓ!

source: What are you?
chr: ᎦᏙ ᎤᏍᏗ ᏂᎯ?

source: What chicken is this?
chr: ᎦᏙ ᎤᏍᏗ ᎯᎠ ᏥᏔᎦ?

source: What is it, chicken?
chr: Ꭷ ᏥᏔᎦ, ᎦᏙ ᎤᏍᏗ?

source: What is this?
chr: ᎦᏙ ᎤᏍᏗ ᎯᎠ?

source: What shall I do with the lazy cat?
chr: ᎦᏙ ᏓᎦᏛᏁᎵ Ꮎ ᎦᎾᎵ ᏪᏌ?

source: What shall I do with the lazy pig?
chr: ᎦᏙ ᏓᎦᏛᏁᎵ Ꮎ ᎦᎾᎵ ᏏᏆ?

source: What shall I do with the lazy rat?
chr: ᎦᏙ ᏓᎦᏛᏁᎵ Ꮎ ᎦᎾᎵ ᎧᏂᏈᏌ?

source: What shall I do with the seed?
chr: ᎦᏙ ᏓᎦᏛᏁᎵ ᎯᎠ ᎤᎩᏔ?

source: What will it be good for?
chr: ᎦᏙ ᎣᏍᏓ ᎨᏎᏍᏗ?

source: What will she do with the flour?
chr: ᎦᏙ ᏛᏛᏁᎵ ᎢᏌ?

source: What will the little red hen do now?
chr: ᎦᏙ ᏛᏛᏁᎵ ᏃᏊ Ꮎ ᎤᏍᏗ ᏥᏔᎦ ᎠᎩᏏ?

source: What will the miller be doing to the wheat?
chr: ᎦᏙ ᏗᏍᏙᏍᎩ ᏛᏛᏁᎵ ᎤᏣᎴᏍᏗ?

source: What, the little red hen lazy?
chr: ᎦᏙ? ᎦᎾᎵᏍ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ?

source: Where did she find the seed?
chr: ᎭᏢ ᎤᎩᏔ ᎤᏩᏛᎮ?

source: Where is the cat?
chr: ᎭᏢ ᏪᏌ?

source: Where is the lazy oat?
chr: ᎭᏢ ᎦᎾᎵ ᏪᏌ?

source: Where is the lazy pig?
chr: ᎭᏢ ᎦᎾᎵ ᏏᏆ?

source: Where is the lazy rat?
chr: ᎭᏢ ᎦᎾᎵ ᎧᏂᏈᏌ?

source: Where is the little red hen?
chr: ᎭᏢ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ?

source: Where is the pig?
chr: ᎭᏢ ᏏᏆ?

source: Where is the rat?
chr: ᎭᏢ ᎧᏂᏈᏌ?

source: Who are you, cat?
chr: ᏂᎯᎾ ᏪᏌ?

source: Who are you, chicken?
chr: ᏂᎯᎾ ᏥᏔᎦ?

source: Who are you, pig?
chr: ᏂᎯᎾ ᏏᏆ?

source: Who are you, rat?
chr: ᏂᎯᎾ ᎧᏂᏈᏌ?

source: Who did go to the mill?
chr: ᎦᎪ ᏗᏍᏙᏍᎩᎢ ᏭᏪᏅᏎ?

source: Who is this?
chr: ᎦᎪ ᎯᎠ?

source: Who was too lazy to find the seed?
chr: ᎦᎪ ᎦᎾᎵ ᎨᏎ ᎠᎴ Ꮭ ᎤᎩᏔ ᏳᏩᏛᎮ?

source: Who was too lazy to gather the wheat?
chr: ᎦᎪ ᎦᎾᎵ ᎨᏎ ᎠᎴ Ꮭ ᎤᏣᎴᏍᏗ ᏳᏩᏟᏌᏁ?

source: Who was too lazy to plant the seed?
chr: ᎦᎪ ᎦᎾᎵ ᎨᏎ ᎠᎴ Ꮭ ᎤᎩᏔ ᏳᏫᏎ?

source: Who will bring it from the mill?
chr: ᎦᎪ ᏗᏍᏙᏍᎩᎢ ᏛᎩᏒᏏ?

source: Who will bring the flour from the mill?
chr: ᎦᎪ ᏗᏍᏙᏍᎩᎢ ᎢᏌ ᏫᏛᎩᏒᏏ?

source: Who will gather the ripe wheat?
chr: ᎦᎪ ᏙᏓᎦᏟᏌᏂ Ꮎ ᎤᏅᏂᏒᎢ ᎤᏣᎴᏍᏗ ᎤᏂᎩᏔ?

source: Who will go to get it?
chr: ᎦᎪ ᏛᎩᏒᏏ?

source: Who will help me gather them?
chr: ᎦᎪ ᏛᎩᏍᏕᎸᎯ ᎤᏂᎩᏔ ᏗᎩᏟᏐᏗ.

source: Who will make the bread?
chr: ᎦᎪ ᏓᎦᏚᏂ?

source: Who will open the bag?
chr: ᎦᎪ ᏕᎦᎵᏗ ᏛᏍᏚᎢᏏ?

source: Who will take it?
chr: ᎦᎪ ᏛᏫᏛᎯ?

source: Who will take the wheat to the mill?
chr: ᎦᎪ ᎤᏣᎴᏍᏗ ᏗᏍᏙᏍᎩᎢ ᏛᏫᏛᎯ?

source: Whose flour is it, cat?
chr: ᎦᎪ ᎤᏤᎵ ᎢᏌ, ᏪᏌ?

source: Whose flour is it, pig?
chr: ᎦᎪ ᎤᏤᎵ ᎢᏌ, ᏏᏆ?

source: Whose flour is it, rat?
chr: ᎦᎪ ᎤᏤᎵ ᎢᏌ, ᎧᏂᏈᏌ?

source: Whose flour is it, then?
chr: ᎦᎪ ᎤᏤᎵ ᎢᏌ ᎾᎯᏳ?

source: Whose wheat is this?
chr: ᎦᎪ ᎤᏤᎵ ᎯᎠ ᎤᏣᎴᏍᏗ?

source: Why are we not kind friends?
chr: ᎦᏙᎲ Ꮭ ᎢᏦᏍᏓ ᎢᏣᎵᎢ ᏱᎩ.

source: Why does the lazy cat not take it?
chr: ᎦᏙᎲ Ꮭ ᎦᎾᎵ ᏪᏌ ᏯᏫᏗᎭ?

source: Why does the lazy rat not take it?
chr: ᎦᏙᎲ Ꮭ ᎦᎾᎵ ᎧᏂᏈᏌ ᏯᏫᏗᎭ?

source: Why does the pig not take it?
chr: ᎦᏙᎲ Ꮭ ᏏᏆ ᏯᏫᏗᎭ?

source: Why must the little red hen take it?
chr: ᎦᏙᎲ ᏥᏔᎦ ᎠᏎ ᎤᏫᏘᏗ?

source: Why must the wheat go to the mill?
chr: ᎦᏙᎲ ᎤᏣᎴᏍᏗ ᏗᏍᏙᏍᎩᎢ ᎠᏎ ᎤᏫᏘᏗ?

source: Will any one open the bag?
chr: ᎩᎶᏍ ᏕᎦᎵᏗ ᏛᏍᏚᎢᏏ?

source: Will that lazy cat go?
chr: ᏛᎩᏒᏏᏍ Ꮎ ᎦᎾᎵ ᏪᏌ?

source: Will that lazy pig go?
chr: ᏛᎩᏒᏏᏍ Ꮎ ᎦᎾᎵ ᏏᏆ?

source: Will that lazy rat go?
chr: ᏛᎩᏒᏏᏍ Ꮎ ᎦᎾᎵ ᎧᏂᏈᏌ?

source: Will the cat drag the big bag?
chr: ᏪᏌᏍ ᎡᏆ ᏕᎦᎵᏗ ᏓᎦᎾᏏᏅᏏ?

source: Will the cat find a seed?
chr: ᏪᏌᏍ ᎡᎵᏊ ᎤᎩᏔ ᏯᏩᏔ?

source: Will the lazy cat bring it?
chr: ᎦᎾᎵᏍ ᏪᏌ ᏫᏛᎩᏒᏏ?

source: Will the lazy pig bring it?
chr: ᎦᎾᎵᏍ ᏏᏆ ᏫᏛᎩᏒᏏ?

source: Will the lazy rat bring it?
chr: ᎦᎾᎵᏍ ᎧᏂᏈᏌ ᏫᏛᎩᏒᏏ?

source: Will the little red hen eat it?
chr: ᏛᎩᏍ Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ?

source: Will the pig drag the big bag?
chr: ᏏᏆᏍ ᎡᏆ ᏕᎦᎵᏗ ᏓᎦᎾᏏᏅᏏ?

source: Will the pig eat it?
chr: ᎠᎬᎭᏍ Ꮎ ᏏᏆ?

source: Will the pig find a seed?
chr: ᏏᏆᏍ ᎡᎵᏊ ᎤᎩᏔ ᏯᏩᏔ?

source: Will the pig open it?
chr: ᏏᏆᏍ ᏛᏍᏚᎢᏏ?

source: Will the rat drag the big bag?
chr: ᎧᏂᏈᏌᏍ ᎡᏆ ᏕᎦᎵᏗ ᏓᎦᎾᏏᏅᏏ?

source: Will the rat find a seed?
chr: ᎧᏂᏈᏌᏍ ᎡᎵᏊ ᎤᎩᏔ ᏯᏩᏔ?

source: Will you bring the bag from the mill?
chr: “ᏗᏍᏙᏍᎩᎢᏍ ᏕᎦᎵᏗ ᏘᎩᏒᏏ?

source: Will you bring the flour, cat?
chr: Ꭷ ᏪᏌ, ᎢᏌᏍ ᏘᎩᏒᏏ?

source: Will you go and get the bag?"
chr: ᏕᎦᎵᏗᏍ ᏘᎩᏒᏏ?”

source: Will you go to the mill for it?"
chr: ᏗᏍᏙᏍᎩᎢᏍ ᏘᎩᏒᏏ?”

source: Will you take it, cat?
chr: Ꭷ ᏪᏌ, ᏘᏫᏛᎯ?

source: Will you take it, pig?
chr: Ꭷ ᏏᏆ, ᏘᏫᏛᎯ?

source: Will you take it, rat?
chr: Ꭷ ᎧᏂᏈᏌ, ᏘᏫᏛᎯ?

source: Will you, pig?"
chr: ᏂᏔᏛᏁᎵ, ᏏᏆ?”

source: Will you, rat?
chr: ᏂᏔᏛᏁᎵ, ᎧᏂᏈᏌ?

source: Yes, I am a chicken.
chr: "ᎥᎥ, ᏥᏥᏔᎦ."

source: Yes, I have a cat friend.
chr: ᎥᎥ, ᎤᎾᎵᎢ ᏪᏌ ᎠᎴ ᏥᏔᎦ.

source: Yes, I have the seed.
chr: ᎥᎥ, ᎤᎩᏔ ᎠᎩᎭ.

source: Yes, it does look good.
chr: ᎥᎥ, ᏭᎪᏛ ᎣᏍᏓ ᏂᎬᏫᏍᏗ ᎦᏚ.

source: Yes, she can get it from the table.
chr: ᎥᎥ, ᎦᏍᎩᎸᎢ ᎬᏩᎩᏍᏗ.

source: Yes, the little red hen found the seed.
chr: ᎥᎥ, Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏔ ᎠᏩᏔ.

source: Yes, the ripe wheat seeds are good.
chr: ᎥᎥ, ᎤᏅᏂᏒᎢ ᎤᏣᎴᏍᏗ ᎠᏂᎩᏔ ᎠᏃᏍᏓ.

source: Yes, the wheat seeds are ripe.
chr: ᎥᎥ, ᎤᏣᎴᏍᏗ ᎠᏂᎩᏔ ᎤᏅᏂᏎ.

source: Yes, this chicken has found a seed.
chr: ᎥᎥ, ᎯᎠ ᏥᏔᎦ ᎤᎩᏔ ᎠᏩᏔ.

source: Yes, this pig is lazy, too.
chr: ᎥᎥ, ᎯᎠ ᏏᏆ ᎦᎾᎵ ᏍᏊ.

source: Yes, this rat is lazy, too.
chr: ᎥᎥ, ᎯᎠ ᎧᏂᏈᏌ ᎦᎾᎵ ᏍᏊ.

source: You are not a kind friend, cat.
chr: Ꮭ ᏍᏙᏍᏓ ᏍᏓᎵᎢ ᏱᎩ, ᏪᏌ.

source: You are not a kind friend, pig.
chr: Ꮭ ᏍᏙᏍᏓ ᏍᏓᎵᎢ ᏱᎩ, ᏏᏆ.

source: You are not a kind friend, rat.
chr: Ꮭ ᏍᏙᏍᏓ ᏍᏓᎵᎢ ᏱᎩ, ᎧᏂᏈᏌ.

source: You are too lazy.
chr: ᎤᏙᎯᏳ ᎢᏥᎾᎵᏒᎢ.

source: You did not find the seed.
chr: Ꮭ ᎤᎩᏔ ᏱᏥᏩᏛᎲᎩ.

source: You did not gather the wheat.
chr: Ꮭ ᎤᏣᎴᏍᏗ ᏱᏥᏟᏌᏅᎩ.

source: You did not help.
chr: Ꮭ ᏱᏣᎵᏍᏕᎸᎮ.

source: You did not plant it.
chr: Ꮭ ᏱᏥᏫᏒᎩ.

source: You did not take it to the mill.
chr: Ꮭ ᏗᏍᏙᏍᎩᎢ ᏱᏥᏫᏛᎲᎩ.

source: You shall not have any flour, cat.
chr: Ꭷ ᏪᏌ, Ꮭ ᎢᏌ ᏱᏓᏣᎯ.

source: You shall not have any flour, pig.
chr: Ꭷ ᏏᏆ, Ꮭ ᎢᏌ ᏱᏓᏣᎯ.

source: You shall not have any flour, rat.
chr: Ꭷ ᎧᏂᏈᏌ, Ꮭ ᎢᏌ ᏱᏓᏣᎯ.

source: You were not kind.
chr: Ꮭ ᎢᏦᏍᏓ ᏱᎩ.

source: You were too lazy.
chr: ᏙᎯᏳ ᎢᏥᎾᎵ.

source: You would not bring it from the mill.
chr: Ꮭ ᏗᏍᏙᏍᎩᎢ ᏱᏥᎩᏒᏒᎭ.

source: You would not gather the wheat.
chr: Ꮭ ᎤᏣᎴᏍᏗ ᏱᏥᏟᏌᏅᎭ.

source: You would not make the bread.
chr: Ꮭ ᎦᏚ ᏱᏥᏚᏅᎭ.

source: You would not open the bag.
chr: Ꮭ ᏕᎦᎵᏗ ᏱᏥᏍᏚᎢᏒᎭ.

source: You would not plant it.
chr: Ꮭ ᏱᏥᏫᏒᎭ.

source: You would not take it to the mill.
chr: Ꮭ ᏗᏍᏙᏍᎩᎢ ᏱᏥᏫᏛᎲᎭ.

source: [picture]
chr: [ᏗᏥᎶᏍᏓᏅᎯ]

source: "Come, pig.
chr: “ᏖᎾ, ᏏᏆ.

source: "I will eat it myself."
chr: “ᎠᏋᏌ ᏥᎩ.”

source: "I will," said the cat.
chr: “ᏂᏓᎦᏛᏁᎵ,” ᎤᏛᏁ ᏪᏌ.

source: "I will," said the rat.
chr: “ᏂᏓᎦᏛᏁᎵ,” ᎤᏛᏁ ᎧᏂᏈᏌ.

source: "I won't," said the lazy cat.
chr: “Ꮭ ᏱᏂᏓᎦᏛᏁᎵ,” ᎤᏛᏁ ᎦᎾᎵ ᏪᏌ.

source: "I won't," said the lazy pig.
chr: “Ꮭ ᏱᏂᏓᎦᏛᏁᎵ,” ᎤᏛᏁ ᎦᎾᎵ ᏏᏆ.

source: "I won't," said the rat
chr: “Ꮭ ᏱᏂᏓᎦᏛᏁᎵ,” ᎤᏛᏁ ᎦᎾᎵ ᎧᏂᏈᏌ.

source: "I'm not leaving to go get it," said the lazy cat.
chr: “Ꮭ ᏱᏥᎩᏎᎦ,” ᎤᏛᏁ ᎦᎾᎵ ᏪᏌ.

source: "I'm not leaving to go get it," said the lazy pig.
chr: “Ꮭ ᏱᏥᎩᏎᎦ,” ᎤᏛᏁ ᎦᎾᎵ ᏏᏆ.

source: "I'm not leaving to go get it," said the lazy rat.
chr: “Ꮭ ᏱᏥᎩᏎᎦ,” ᎤᏛᏁ ᎦᎾᎵ ᎧᏂᏈᏌ.

source: "Now, we will make some bread," she said.
chr: “ᏃᏊ, ᎦᏚ ᏓᏗᏚᏂ,” ᎤᏛᏁ.

source: "O come, come," said the little red hen.
chr: “Ꭳ, ᏓᏤᎾ, ᏓᏤᎾ,” ᎤᏛᏁ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: "O see the wheat!" said the little red hen.
chr: “Ꭳ ᎤᏣᎴᏍᏗ ᎢᏥᎪᏩᏔ!” ᎤᏛᏁ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: "See my bread, pig!" she said.
chr: “Ꮒ, ᎠᏆᏤᎵ ᎦᏚ, ᏏᏆ!” ᎤᏛᏁ.

source: "See, cat!
chr: “Ꮒ, ᏪᏌ!

source: "Then I alone will," said the little red hen.
chr: “ᎾᎯᏳ ᎠᏋᏌ ᏂᏓᎦᏛᏁᎵ,” ᎤᏛᏁ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: "Who will go and get the flour?" said the little red hen.
chr: “ᎦᎪ ᎢᏌ ᏛᎩᏒᏏ?” ᎤᏛᏁ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: "Who will help me gather it?"
chr: “ᎦᎪ ᎠᎩᏟᏐᏗ ᏛᎩᏍᏕᎸᎯ?”

source: "Who will help me make some bread?"
chr: “ᎦᎪ ᎦᏚ ᏣᏘᏗ ᏛᎩᏍᏕᎸᎯ?”

source: "Who will take the bag to the mill?" said the little red hen.
chr: “ᎦᎪ ᏕᎦᎵᏗ ᏗᏍᏙᏍᎩᎢ ᏛᏫᏛᎯ?” ᎤᏛᏁ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: (The complete story.)
chr: ᏂᎦᏓ ᎧᏃᎮᏗ

source: Action, Imitation and Fun Series
chr: ᏂᏧᏛᏁᎸᎢ, ᏧᏰᎵᏒᎢ, ᎠᎴ ᏧᏬᎵᏗ ᎠᏦᏪᎳᏅᎢ

source: And they went.
chr: ᎠᎴ ᏭᏁᏅᏎ.

source: By and by it was a wheat plant.
chr: ᎾᎯᏳ ᎤᏣᎴᏍᏗ ᎦᎪᏗ ᏄᎵᏍᏔᏁ.

source: By and by the wheat was ground into flour.
chr: ᎾᎯᏳ ᎢᏌ ᏄᎵᏍᏔᏁ Ꮎ ᎤᏣᎴᏍᏗ.

source: Chapter I
chr: ᎠᏯᏙᎸᎢ 1

source: Chapter II
chr: ᎠᏯᏙᎸᎢ 2

source: Chapter III
chr: ᎠᏯᏙᎸᎢ 3

source: Chapter IV
chr: ᎠᏯᏙᎸᎢ 4

source: Chapter V
chr: ᎠᏯᏙᎸᎢ 5

source: Come, cat.
chr: ᏖᎾ, ᏪᏌ.

source: Come, rat.
chr: ᏖᎾ, ᎧᏂᏈᏌ.

source: Come, see what I have just found."
chr: ᏓᏤᎾ, ᎪᎱᏍᏗ ᏥᏩᏔ ᎢᏥᎪᏩᏔ.”

source: I am the lazy cat.
chr: “ᏥᎾᎵ ᏪᏌ.”

source: It grew and grew and grew.
chr: ᎤᏛᏎ ᎠᎴ ᎤᏛᏎ ᎠᎴ ᎤᏛᏎ.

source: It ground and ground and ground.
chr: ᎤᏍᏙᎡ ᎠᎴ ᎤᏍᏙᎡ ᎠᎴ ᎤᏍᏙᎡ.

source: It was a wheat seed.
chr: ᎤᏣᎴᏍᏗ ᎤᎩᏔ ᎨᏎ.

source: Now the little red hen made bread from the wheat flour.
chr: ᏃᏊ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎦᏚ ᎤᏩᏚᏁ ᎤᏣᎴᏍᏗ ᎢᏌ ᎬᏗ.

source: Once there was a little red hen.
chr: ᏌᏊ ᎢᏳᏩᎪᏘ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎡᎮ.

source: One day the little red hen found a seed.
chr: ᏌᏊ ᎢᎦ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎤᎩᏔ ᎤᏩᏛᎮ.

source: One was a cat.
chr: ᏌᏊ ᏪᏌ ᎨᏎ.

source: One was a pig.
chr: ᏌᏊ ᏏᏆ ᎨᏎ.

source: One was a rat.
chr: ᏌᏊ ᎧᏂᏈᏌ ᎨᏎ.

source: See the little red hen.
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ ᎯᎪᏩᏔ.

source: See what I have found.
chr: ᎪᎱᏍᏗ ᏥᏩᏔ. ᎢᏥᎪᏩᏔ.

source: See what the chicken just found.
chr: ᎯᎪᏩᏔ ᎥᏍᎩᎾ ᎠᏩᏔ Ꮎ ᏥᏔᎦ.

source: See, here is the wheat flour.
chr: ᎢᏥᎪᏩᏔ, ᎠᎭᏂ ᎤᏣᎴᏍᏗ ᎢᏌ.

source: See, rat!
chr: Ꮒ, ᎧᏂᏈᏌ!

source: She brought the flour.
chr: ᎢᏌ ᎤᎩᏒᏎ.

source: She had three friends.
chr: ᎠᏂᏦᎢ ᏧᎾᎵᎢ ᎨᏎ.

source: She just found a seed.
chr: ᎤᎩᏔ ᎠᏩᏔ.

source: She put it in a bag.
chr: ᏕᎦᎵᏗ ᎤᎵᏔᏁ.

source: She put it on the table.
chr: ᎦᏍᎩᎸᎢ ᎤᏝᏁ.

source: So the little red hen gathered the wheat.
chr: ᎤᏣᎴᏍᏗᏃ ᎤᏩᏟᏌᏁ Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: So the little red hen planted the wheat seed.
chr: ᎤᏣᎴᏍᏗᏃ ᎤᎩᏔ ᎤᏫᏎ Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: So the little red hen went to the mill.
chr: ᎠᎴ ᏗᏍᏙᏍᎩᎢ ᏭᏪᏅᏎ Ꮎ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: THE LITTLE RED HEN
chr: ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: THE STORY OF THE LITTLE RED HEN
chr: Ꮎ ᎧᏃᎮᏗ ᎤᏍᏗ ᎠᎩᎦᎨ ᏥᏔᎦ ᎠᎩᏏ.

source: The chicken just found a seed.
chr: ᏥᏔᎦ ᎤᎩᏔ ᎠᏩᏔ.

source: The miller ground the wheat.
chr: ᏗᏍᏙᏍᎩ ᎤᏣᎴᏍᏗ ᎤᏍᏙᎡ.

source: The miller put the flour into the bag.
chr: ᏕᎦᎵᏗ ᎢᏌ ᎤᎵᏔᏁ Ꮎ ᏗᏍᏙᏍᎩ.

source: There were wheat seeds on the plant.
chr: ᎤᏣᎴᏍᏗᏃ ᎤᏂᎩᏔ ᎨᏎ.

source: Who will help me eat it?"
chr: ᎦᎪ ᎠᎩᎩᏍᏗ ᏛᎩᏍᏕᎸᎯ?”

source: Who will help me plant it?"
chr: ᎦᎪ ᏓᏣᏍᏕᎸᎯ ᎠᎩᏫᏍᏗ?”
